#+TITLE: Rasp Leds V2
#+AUTHOR: Davis Schenkenberger

*** Info
#+begin_src restclient :noweb yes
GET http://<<ip>>/api/info
#+end_src

#+RESULTS:
#+begin_example
,#+BEGIN_SRC js
{
  "led_count": 150,
  "current_state": "Idle",
  "state": [
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    },
    {
      "RGB": [
        0,
        0,
        0
      ]
    }
  ]
}
// GET http://0.0.0.0:8080/api/info
// HTTP/1.1 200 OK
// content-type: application/json
// server: Rocket
// x-content-type-options: nosniff
// x-frame-options: SAMEORIGIN
// permissions-policy: interest-cohort=()
// content-length: 2450
// date: Mon, 04 Apr 2022 21:13:51 GMT
// Request duration: 0.041681s
,#+END_SRC
#+end_example
